Repository: jhonny1994/peerlink
Catalog: lib/src/shared/localization/l10n/intl_*.arb
Languages: ar

# appTagline
source: Secure P2P file transfer
ar: نقل ملفات آمن من نظير إلى نظير

source: Send File
ar: إرسال ملف

source: Receive File
ar: استقبال ملف

source: Settings
ar: الإعدادات

# homeInfoText
source: Transfers are encrypted and peer-to-peer. No cloud storage. Max 100MB per file.
ar: عمليات النقل مشفرة ومباشرة من نظير إلى نظير. لا تخزين سحابي. الحد الأقصى 100 ميجابايت لكل ملف.

source: Sending file...
ar: جاري إرسال الملف...

source: Receiving file...
ar: جاري استقبال الملف...

source: Cancel Transfer
ar: إلغاء النقل

source: Select File
ar: اختر ملف

source: Share Code
ar: مشاركة الرمز

# sendingFileTitle
source: Sending File
ar: إرسال ملف

source: Transfer Complete
ar: اكتمل النقل

source: File sent successfully!
ar: تم إرسال الملف بنجاح!

source: Copy Code
ar: نسخ الرمز

# codeCopied
source: Code copied to clipboard
ar: تم نسخ الرمز إلى الحافظة

# shareThisCode
source: Share this code with the receiver
ar: شارك هذا الرمز مع المستقبل

# waitingForReceiver
source: Waiting for receiver to connect...
ar: في انتظار اتصال المستقبل...

source: Enter Code
ar: أدخل الرمز

source: Accept File
ar: قبول الملف

# receivingFileTitle
source: Receiving File
ar: استقبال ملف

source: File received successfully!
ar: تم استقبال الملف بنجاح!

# enterCodePrompt
source: Enter the 6-digit code from sender
ar: أدخل الرمز المكون من 6 أرقام من المرسل

source: Scan QR Code
ar: مسح رمز الاستجابة السريعة

# scanQrCodePrompt
source: Point camera at the QR code shown by sender
ar: وجّه الكاميرا نحو رمز الاستجابة السريعة المعروض من المرسل

source: OR
ar: أو

# acceptFilePrompt
source: Accept this file?
ar: قبول هذا الملف؟

# settingsTitle
source: Settings
ar: الإعدادات

# settingsInfo
source: Customize your PeerLink experience with theme and display preferences.
ar: خصص تجربتك في PeerLink مع تفضيلات المظهر والعرض.

source: Appearance
ar: المظهر

# themeLight
source: Light Theme
ar: المظهر الفاتح

# themeLightDesc
source: Use light theme
ar: استخدام المظهر الفاتح

# themeDark
source: Dark Theme
ar: المظهر الداكن

# themeDarkDesc
source: Use dark theme
ar: استخدام المظهر الداكن

# themeSystem
source: System Default
ar: افتراضي النظام

# themeSystemDesc
source: Follow system theme
ar: اتباع مظهر النظام

source: About
ar: حول

# licenses
source: Open Source Licenses
ar: تراخيص المصادر المفتوحة

source: Theme
ar: المظهر

source: Language
ar: اللغة

source: Done
ar: تم

source: Cancel
ar: إلغاء

source: Confirm
ar: تأكيد

source: OK
ar: موافق

source: Dismiss
ar: إغلاق

source: Retry
ar: إعادة المحاولة

# errorFileTooLarge
source: File is larger than the 100MB limit.
ar: الملف أكبر من الحد الأقصى وهو 100 ميجابايت.

# errorCodeRequired
source: Please enter the 6-digit code
ar: الرجاء إدخال الرمز المكون من 6 أرقام

# errorCodeInvalid
source: Code must be exactly 6 digits
ar: يجب أن يتكون الرمز من 6 أرقام بالضبط

# errorCameraPermissionDenied
source: Camera permission is required to scan QR codes
ar: إذن الكاميرا مطلوب لمسح رموز الاستجابة السريعة

# errorCameraPermissionPermanentlyDenied
source: Camera permission permanently denied. Please enable it in device settings.
ar: تم رفض إذن الكاميرا بشكل دائم. يرجى تفعيله في إعدادات الجهاز.

# errorConnectionTimeout
source: Connection timed out. Please check your network and try again.
ar: انتهت مهلة الاتصال. يرجى التحقق من شبكتك والمحاولة مرة أخرى.

# errorCouldNotConnect
source: Could not connect to the other device. Please verify the code.
ar: تعذر الاتصال بالجهاز الآخر. يرجى التحقق من الرمز.

# errorTransferStalled
source: Transfer stalled and was cancelled. Please try again.
ar: توقف النقل وتم إلغاؤه. يرجى المحاولة مرة أخرى.

# errorFileVerificationFailed
source: File verification failed. The file may be corrupt. Please try sending again.
ar: فشل التحقق من الملف. قد يكون الملف تالفًا. يرجى المحاولة مرة أخرى.

# errorTurnQuotaExceeded
source: Connection failed. The free service limit may have been reached. Please try again later.
ar: فشل الاتصال. ربما تم الوصول إلى حد الخدمة المجانية. يرجى المحاولة لاحقًا.

# errorCameraPermission
source: Camera permission is required to scan QR codes. Please grant permission in settings.
ar: إذن الكاميرا مطلوب لمسح رموز الاستجابة السريعة. يرجى منح الإذن في الإعدادات.

# errorStoragePermission
source: Storage permission is required to save files. Please grant permission in settings.
ar: إذن التخزين مطلوب لحفظ الملفات. يرجى منح الإذن في الإعدادات.

# errorPermissionDenied
source: Permission denied. Please check app permissions in settings.
ar: تم رفض الإذن. يرجى التحقق من أذونات التطبيق في الإعدادات.

# errorNetwork
source: Network error. Please check your internet connection and try again.
ar: خطأ في الشبكة. يرجى التحقق من اتصال الإنترنت والمحاولة مرة أخرى.

# errorSessionExpired
source: Session expired or invalid. Please generate a new code and try again.
ar: انتهت صلاحية الجلسة أو غير صالحة. يرجى إنشاء رمز جديد والمحاولة مرة أخرى.

# errorInvalidCode
source: Invalid code. Please check the code and try again.
ar: رمز غير صالح. يرجى التحقق من الرمز والمحاولة مرة أخرى.

# errorServiceUnavailable
source: Service temporarily unavailable. Please try again in a moment.
ar: الخدمة غير متاحة مؤقتًا. يرجى المحاولة بعد قليل.

# errorUnexpected
source: An unexpected error occurred. Please try again.
ar: حدث خطأ غير متوقع. يرجى المحاولة مرة أخرى.

# errorFilePathUnavailable
source: Unable to access file path. Please try again.
ar: تعذر الوصول إلى مسار الملف. يرجى المحاولة مرة أخرى.

# errorFileNotFound
source: Selected file does not exist. Please try again.
ar: الملف المحدد غير موجود. يرجى المحاولة مرة أخرى.

# errorFilePickerFailed
source: An error occurred while picking the file
ar: حدث خطأ أثناء اختيار الملف

# unitBytes
source: B
ar: بايت

# unitKilobytes
source: KB
ar: كيلوبايت

# unitMegabytes
source: MB
ar: ميجابايت

source: Please wait...
ar: يرجى الانتظار...

source: Loading...
ar: جاري التحميل...
